#!/usr/bin/env python
# -*-coding=utf-8-*-
"""
author:lkw
date:2018.6.10
function:存放零散的字典信息，包括：
technical_class_word：技术指标类别，
technical_index_word：技术指标词，
ratio_index：比率指标，需要在后面加%进行输出,
corpus_word:需要在jieba自定义字典中定义的语料库的词语。
"""

technical_class_word = {'均线': 1, 'ma': 1, '移动平均线': 1, 'kdj': 2, '随机指标': 2,
                        'boll': 3, '布林线': 3, 'macd': 4, '指数平滑移动平均线': 4, '放量': 5, '缩量': 5}

technical_index_word = ['均线', 'kdj', 'boll', 'macd', '放量', '回踩', '上探', '多头', '上穿',
                        '金叉', '死叉', '上轨', '中轨', '下轨', '零轴以上', '零轴以下', '顶背离',
                        '0轴以上', '0轴以下', '0轴', '零轴', '上破'
                        '底背离', '天量', '缩量', '巨量', '移动平均线', '随机指标',
                        '布林线', '指数平滑移动平均线', 'ma',
                        '五日', '十日', '三十日', '六十日', '一百二十日', '二百四十日', '5日',
                        '10日', '30日', '60日', '120日', '240日', '5天', '10天', '30天', '60天',
                        '120天', '240天', '五天', '十天', '三十天', '六十天', '一百二十天', '二百四十四天']

ratio_index = ['涨跌幅', '振幅', '市盈率', '市净率', '市销率', '股息率', '销售净利率',
               '经营利润率', '净利润率', '营业收入增长率', '净利润增长率', '总资产收益率',
               '净资产收益率', '资本回报率',
               '每股收益增长率', '负债权益比', '归属母公司股东权益增长率', '单季度归母净利润增长率',
               '现金比率', '销售现金比率', '经营现金净流量对销售收入比率',
               '应收账款周转率', '存货周转率', '流动资产周转率', '销售毛利率',
               '固定资产周转率', '总资产周转率', '流动比率', '速动比率',
               '产权比率', '无形资产比率', '固定资产比率', '非流动资产比率',
               '股东权益比率', '资本化比率', '股东权益与固定资产比率', '净资产增长率',
               '营业利润增长率', '成本费用利润率', '成本费用净利润率', '现金流动负债比率',
               '有形净值债务率', '偿债保障比率', '资产负债比率', '长期负债比率',
               '基本收益率', '资产利润率', '股利支付率', '本息偿付比率',
               '收益留存率', '总资产增长率', '可持续增长率', '资本负债比率']

corpus_word = ['不低于', '不高于', '不高过', '不低过', '不超过', '不大于', '不少于',
               '不小于', '不多于', '之间', '比较高', '比较低', '财报', '简况',
               '异常高', '较高', '日K', '周K', '月K', '日度', '分钟线', '研报',
               '较低', '很低', '很高', '异常低', '研究报告',
               '非常高', '非常低', '特别高',
               '特别低', '小于等于', '大于等于', '降序',
               '升序', '取值', '从低到高', '从小到大',
               '从高到低', '从大到小', '低出', '高出',
               '没超过', '没低于', '没多于', '没高于',
               '没低过', '没少于', '没小于', '没大于',
               '没低过', '没高过', '不超出', '上面',
               '以上', '以下', '下面', '之下',
               '之上', '走势', 'K线', '分时',

               '投顾建议', '好不好', '怎么样', '入手', '目标价位', '涨幅空间', '推荐评级',
               '能涨', '机构评价', '专家评价', '评级', '资金面', '基本面', '财务面',
               '上涨潜力', '综合分析', '模拟走势', '相似K线', '筹码', '成本分析', '支撑位', '压力位',
               '市场热度', '人气指数', '市场热度评分', '消息测评', '机构调研',
               '主力强度', '主力强度评分', '主力资金',
               '主力成本', '龙虎榜', '融资买入', '资金分布图',
               '价值评估', '走势分析', '走势分析评分', '市场表现',
               '板块潜力', '价值评估评分', '估值', '成长情况',
               '盈利情况', '资产状况', '现金', '牛人解读',
               '投顾', '牛人解读评分', '牛人热度', '最新解读',
               '没低过', '没高过', '不超出', '上面',
               '以上', '以下', '下面', '之下',
               '之上', '走势', 'K线', '分时',

               '解释', '百科', '指什么', '市场分析', '最新推荐', '推荐', '市场评级',
               '评分', '推荐次数', '行业报告', '股票推荐', '热捧',
               '行业推荐', '建议次数',
               '看好', '分析师', '研究员', '怎么样', '咋样', '能买吗',

               '机构推荐', '研判', '个股研判', '机构评级', '综合评分', '升值空间', '最大涨幅',
               '资金分析', '资金面分析', '流入', '散户', '散户流入',
               '流出', '散户流出', '净流入资金', '主力', '主力流出', '五日资金流向', '5日资金流向',
               '流出资金', '净流入', '资金分布', '财务面', '财务', '财务分析',
               '财务状况', '财务情况', '财务评分', '评分', '盈利情况', '盈利',
               '盈利能力', '盈利状况', '成长', '成长情况', '成长能力', '成长打分',
               '成长状况', '资产', '资产能力', '资产情况', '资产状况', '资产打分',
               '资产分数', '估值', '估值打分', '估值能力', '估值情况', '估值分析',

               '现金', '现金分析', '现金情况', '现金能力', '现金状况', '财务点评',
               '财务指标', '利润表', '负债表', '利润表', '资产负债表', '现金流量表',
               '同行财务', '行业财务', '技术分析', '技术面分析', '技术面', '技术评分',
               '技术指标', '基本面', '新闻', '最新消息', '资讯', '公告',
               '简况', '公司名称', '上市日期', '发行价格', '发行数量', '每手股数',
               ]
