#!/usr/bin/env python
# -*-coding=utf-8-*-
"""
author:lkw
date:2018.6.10
function:存放关系词信息。
"""

operator_reflection = {'区间': 'A',
                       '大于': 'B', '大于等于': 'B', '不小于': 'B', '超过': 'B', '不低于': 'B',
                       '多于': 'B', '不少于': 'B', '高出': 'B', '不低过': 'B',
                       '以上': 'B', '之上': 'B', '上面': 'B',
                       '小于': 'C', '高于': 'B',
                       '小于等于': 'C', '不大于': 'C', '没超过': 'C', '低于': 'C', '少于': 'C',
                       '不多于': 'C', '低出': 'C', '不高过': 'C', '不高出': 'C', '不超过': 'C',
                       '以下': 'C', '之下': 'C', '下面': 'C',
                       '最低': 'B1', '很低': 'B1',
                       '特别低': 'B1', '非常低': 'B1', '异常低': 'B1',
                       '比较低': 'B1', '较低': 'B1', '从低到高': 'B1', '从小到大': 'B1', '升序': 'B1',
                       '最高': 'C1', '排名': 'C1', '排行': 'C1',
                       '很高': 'C1', '非常高': 'C1', '特别高': 'C1', '较高': 'C1', '比较高': 'C1',
                       '从高到低': 'C1', '从大到小': 'C1', '降序': 'C1', '异常高': 'C1'}
no_number_operator = {
                       '最低': 'B1', '很低': 'B1',
                       '特别低': 'B1', '非常低': 'B1', '异常低': 'B1',
                       '比较低': 'B1', '较低': 'B1', '从低到高': 'B1', '从小到大': 'B1', '升序': 'B1',
                       '最高': 'C1', '排名': 'C1', '排行': 'C1',
                       '很高': 'C1', '非常高': 'C1', '特别高': 'C1', '较高': 'C1', '比较高': 'C1',
                       '从高到低': 'C1', '从大到小': 'C1', '降序': 'C1', '异常高': 'C1'}
